In [ ]:
import pandas as pd
print("Done")

Done

In [ ]:
MAIN_DATA = pd.read_csv("/content/train(1).csv")

In [ ]:
df = MAIN_DATA.copy()

In [ ]:
df_test = df[["Name", "Age", "Sex"]].copy()

In [ ]:
df_test

                                                  Name   Age Sex
0                              Braund, Mr. Owen Harris  22.0   0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0   1
2                               Heikkinen, Miss. Laina  26.0   1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0   1
4                             Allen, Mr. William Henry  35.0   0
..                                                 ...   ...  ..
886                              Montvila, Rev. Juozas  27.0   0
887                       Graham, Miss. Margaret Edith  19.0   1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN   1
889                              Behr, Mr. Karl Howell  26.0   0
890                                Dooley, Mr. Patrick  32.0   0

[891 rows x 3 columns]

In [ ]:
#b II zamień male na 0 i female na 1 

df_test["Sex"] = [wiersz.replace(["female", "male"], ["1", "0"]) for wiersz in df_test["Sex"]]

In [ ]:
df_test["Sex"] = [wiersz.replace("male","0")for wiersz in df_test["Sex"]]

In [ ]:
df_test["Sex"].value_counts()

In [ ]:
data_katastrofy = 1912
df_test["Rok urodzenia"] = [data_katastrofy - value for value in df_test["Age"]]

In [ ]:
df_test

Funkcje

In [ ]:
#funkcja
funkcja(obiekt)
#metoda
obiekt.metoda()

In [ ]:
#drukarka

def drukarka():
  print("To jest strona testowa naszej drukarki")

In [ ]:
drukarka()

In [ ]:
def dodawanie(liczba1, liczba2):
  wynik = liczba1 + liczba2
  return wynik

In [ ]:
x = dodawanie(2, 5)

In [ ]:
x

7

In [ ]:
x = "PaT%RYk JEST głUpi!     "

#Patryk jest głupi

In [ ]:
def clean_text(text):
  new_text = text.lower().replace("%", "").replace("!", "").strip().capitalize()
  return new_text

In [ ]:
x

'PaT%RYk JEST głUpi!     '

In [ ]:
x2 = clean_text(x)

In [ ]:
x2

'Patryk jest głupi'

In [ ]:
x3 = "Uni%WerSytet WarszAWSKI JEST głUpi!     "

In [ ]:
x4 = clean_text(x3)

In [ ]:
x4

In [ ]:
df_testy = pd.DataFrame({"Nazwisko, imię" : ["Hubar, Patryk", "Nowak, Adam", "Duda, Andrzej"], "Punkty" : [15, 12, 1]})

In [ ]:
df_testy

  Nazwisko, imię  Punkty
0  Hubar, Patryk      15
1    Nowak, Adam      12
2  Duda, Andrzej       1

In [ ]:
#jaka ocena - funkcja

def jaka_ocena(punkty):
  if punkty >= 15:
    return "Bardzo dobry"
  elif punkty < 15 and punkty >= 8:
    return "Dobry"
  else:
    return "Niedostateczny"

In [ ]:
jaka_ocena(1)

Iterowanie po pandas part 2

In [ ]:
df_testy

In [ ]:
#List Comprehension
# [value + 1 for value in df_testy["Ocena"]]

#Apply

df_testy["Ocena"] = df_testy["Punkty"].apply(jaka_ocena)

for value in df_testy:
  jaka_ocena(value)


#W ARGUMENCIE APPLY PODAJEMY TYLKO I WYŁACZNIE NAZWE FUNKCJI KTORA CHCEMY ZASTOSOWAC 
# np .apply(funkcja)
#NIE PODAJEMY PO NAZWIE FUNKCJI NAWIASOW OKRAGLYCH
#np .apply(funkcja()) - będzie błedne